Pandas import convention
https://www.educative.io/blog/pandas-cheat-sheet

# Install pandas

In [2]:
import pandas as pd

#### Create and Name a Series

In [12]:
series1 = pd.Series(([1,2,3,4]), index=['a','b','c','d'])

In [11]:
series1 = pd.Series(([1,2,3,4]), index=['a', 'b', 'c', 'd'])
series1

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
df = pd.DataFrame(
         {"a" : [1 ,2, 3],
          "b" : [7, 8, 9],
          "c" : [10, 11, 12]},        index = [1, 2, 3])
df

   a  b   c
1  1  7  10
2  2  8  11
3  3  9  12

#### Create a Data Frame 
Create a two-dimensional data structure with columns. create and print a df.

In [14]:
df = pd.DataFrame(
  {'a' : [1,2,3,],
   'b' : [7,8,9],
   'c' : [10,11,12]}, index = [1,2,3])

df

   a  b   c
1  1  7  10
2  2  8  11
3  3  9  12

#### Specify values in data frame columns

Specify how you want to organize your DataFrame by Columns

In [16]:
df = pd.DataFrame([[1,2,3],
                  [4,5,6],
                  [10,11,12]],
                   index = [1,2,3],
                  columns = ['a','b','c'])

df

    a   b   c
1   1   2   3
2   4   5   6
3  10  11  12

In [29]:
df = pd.DataFrame([[1,1],
                   [3,4],
                   [4,5]], 
                  index = [1,2,3], 
                  columns = ['g','d'])
df

   g  d
1  1  1
2  3  4
3  4  5

In [35]:
df = pd.DataFrame([[3,4],[34,45],[3434,5]], index = [1,2,3], columns=['f','t'])
df

      f   t
1     3   4
2    34  45
3  3434   5

In [36]:
 df.shape

(3, 2)

#### Retrieve rows and columns description

In [37]:
df.rank

<bound method NDFrame.rank of       f   t
1     3   4
2    34  45
3  3434   5>

In [39]:
df.columns = ['test','result']
df

   test  result
1     3       4
2    34      45
3  3434       5

In [41]:
df.index = ['a','c','f']
df

   test  result
a     3       4
c    34      45
f  3434       5

In [42]:
df.columns

Index(['test', 'result'], dtype='object')

In [43]:
df.index

Index(['a', 'c', 'f'], dtype='object')

In [44]:
df.info

<bound method DataFrame.info of    test  result
a     3       4
c    34      45
f  3434       5>

In [46]:
df.describe()

              test     result
count     3.000000   3.000000
mean   1157.000000  18.000000
std    1972.000761  23.388031
min       3.000000   4.000000
25%      18.500000   4.500000
50%      34.000000   5.000000
75%    1734.000000  25.000000
max    3434.000000  45.000000

In [50]:
df.columns  = ['one','two']
df.describe()

               one        two
count     3.000000   3.000000
mean   1157.000000  18.000000
std    1972.000761  23.388031
min       3.000000   4.000000
25%      18.500000   4.500000
50%      34.000000   5.000000
75%    1734.000000  25.000000
max    3434.000000  45.000000

### Get sum of values

In [51]:
df.sum()

one    3471
two      54
dtype: int64

In [52]:
df

    one  two
a     3    4
c    34   45
f  3434    5

In [53]:
df.idxmin()

one    a
two    a
dtype: object

In [54]:
df.idxmax()

one    f
two    c
dtype: object

In [56]:
df.mul(2)
df.div(2)

      one   two
a     1.5   2.0
c    17.0  22.5
f  1717.0   2.5

In [58]:
df.info()
df.count()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to f
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      int64
 1   two     3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

one    3
two    3
dtype: int64

In [59]:
df.min()

one    3
two    4
dtype: int64

In [60]:
df.max()

one    3434
two      45
dtype: int64

In [61]:
df.mean()

one    1157.0
two      18.0
dtype: float64

In [62]:
df.median()

one    34.0
two     5.0
dtype: float64

In [63]:
df.describe()

               one        two
count     3.000000   3.000000
mean   1157.000000  18.000000
std    1972.000761  23.388031
min       3.000000   4.000000
25%      18.500000   4.500000
50%      34.000000   5.000000
75%    1734.000000  25.000000
max    3434.000000  45.000000